---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecDemandfactorDemandloadParam
source: html/0ce56370-c07d-d1e7-a658-032e191d3054.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecDemandfactorDemandloadParam Property

"Estimated Demand Load"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecDemandfactorDemandloadParam { get; }
```